# ClearHandleConstraintPairHighlighting Method

---
C#Visual BasicVisual C++
Revit 2024 API
---
RebarConstraintsManager..::..ClearHandleConstraintPairHighlighting Method
RebarConstraintsManager Class See Also
---
Clears all highlighting in all views.
**Namespace:** Autodesk.Revit.DB.Structure**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2014
# Syntax
C#
---
```text
public void ClearHandleConstraintPairHighlighting(
	Document aDoc
)
```

Visual Basic
---
```text
Public Sub ClearHandleConstraintPairHighlighting ( _
	aDoc As Document _
)
```

Visual C++
---
```text
public:
void ClearHandleConstraintPairHighlighting(
	Document^ aDoc
)
```

# ### Parameters
aDoc
    Type: Autodesk.Revit.DB..::..Document
# Remarks
If highlightHandleConstraintPairInAllViews has been called, then this method can be used to remove all highlighting.
# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentNullException | A non-optional argument was null |

# See Also
RebarConstraintsManager Class
Autodesk.Revit.DB.Structure Namespace